# /for= працює до тих пір поки мова повертає нам тру.Єдиний момент for в пайтоні цикл працює з колекціями
# які мають певну кількість з діапазонами.range(10)-яка генерує нам цифри наприклад це діапазон цифр від 0 до 10 і просто
# зараз їх буду виводити = і 10 не виводиться.Функція range може приймати в собі один параметр кінець доки рахувати (10)
# а може приймати три параметри(старт, стоп, степ)старт- звідки ми стартуємо 2,стоп =до якого числа повинно виконуватися,
# степ=яка виконується дія,або який крок кожне 5 число
for i in range(10):
     print(i)
# вивисти всі числа які діляться на 5 з 10 до 100
for i in range(10,100,5):
    print(i)
    # for записує i ,і дальше щось робимо print(i)=зараз просто виводимо на екран
