# # оператор арифматичний
# i=6+8
# print(i)
# i=8-6
# print(i)
# i=6*3
# print(i)
# # використання ділення / отримаємо значення фло, щоб отримати інтове число то ставимо //
# i=30/5
# print(i)
# i=18//3
# print(i)
# # обчислення або приведення до степеня
# i=2**3
# print(i)
# # ділення по модулю або ділення з остачою(то б то дає відповідь остачу 11/3=3,2 воно дає 2)
# i=11%3
# print(i)

# # оператор логічний тому що вони повертають нам true \ false
# print(5<6)
# print(10>2)
# print(5<=6)
# print(6>=8)
# # =цу знак присвоєння  ==дорівнює != не рівне один символ другому
# print(5 == 5)
# print(5!=3)

# є арифметичні оператори які дають, з мого пере присвоювати(збільшити на один)
i=2
i  += 3
# + - * / // ** % може бути перед дорівнює(вони присвоюються уже до існуючої зміної )
