# дає змогу розгалуження в програмі залежності від того що повертає або не повертає наш оператор
# показує що 5 менше 6 і дія буде виконуватися і напише ок(тобто якщо буде тру то виконується,
# а якщо ні буде фолз то дія не виконається) а коли не працює if і дає  false  то працює else
# if 5<6 :
#     print ('ok')
# if 5==6:
#     print('ok')
# else:
#     print ('error')

# #з чим працює  як це може бути працювати; elif=пере провіряє  if=працює з логічними оператором
# (що це означає то бто оператор if повинен повертати true/false)
# i=5
# if i<=6:
#     print('ok')
# else:
#     print('error')
 # якщо потрібно провірити декілька значень
# i =5
# if i==4:
#         print('i =4')
# elif i==5:
#         print('i=5')
# elif i==6:
#         print('i=6')
# else:
#         print('error')

# if працює з оператором  or(або) яка повинна повернути true
# i = 6
# if i==5 or i==6:
#     print('ok')
#  є оператор and який говорить що 1 частина і 2 частина повинна повернути true(правильно)
# i=5
# if i==5 and i==6:
#     print('ok')
# розвертає нам наше значення,міняє значення на протилежне значення
# i=False
# if not i:
#     print('ok')
i=True
if not i:
    print('ok')