# while-це цикл який дає змогу нам виконувати код якусь певну кількість раз.Що потрібно пам'ятати,
# що для циклу потрібно три штуки операції(1-зміна яка буде нашим лічильником,2-який перепровіряє відпрацьовує
# до тих пір доки в нього повертається тру поки i Менша за 5; -перед ним повинно бути 4 пробілів.3- наш
# оператор повинен змінюватися на 1 а не зациклюватися)(тобто три умови= змінна, умова=оператор який буде повертати,
# умова=збільшення цієї зміни)
# while може працювати else -який в кінці циклу по любому відпрацює
i=0
while i<5:
    print(i)
    i+=1
else:
    print('the end')
# якщо цикл ні разу не відпрацює, то else відпрацює
i=6
while i<5:
    print(i)
    i+=1
else:
    print('ok')
# while=існує для того, щоб прокручувати певнний код скільки разів скільки нам потрібно