# str=є об'єктом але щоб краще зрозуміти то козна строка це є колекція символів

# як нам витянути символи із колекції
#    012345678910...
st ='hello, world!'
print(st[0])
# перебрати
st ='hello, world!'
for i in st:
    print( '=', i)
# витягнути якусь частину=за допомоги зрізу(з до)
st ='hello, world!'
print(st [2:10])
print(st[:10])
# можна також витягнути і вказати крок (кожний другий)
st = 'hello, world!'
print(st[0:13:2])
# можна також витягнути останній символ
st = 'hello, world!'
print(st[-1])
# можна також витягнути з кінця до початку
st = 'hello, world!'
print(st[::-1])
print(st[10:2:-1])