# 2)написати прогу яка вибирає зі введеної строки числа і виводить їх
# так як вони написані
# наприклад:
#   st = 'as 23 fdfdg544 34' #введена строка
#   23, 544, 34              #вивело в консолі

st = "as 23 fdfdg544 34"
 # Сюди збираємо цифри (формуємо числа
num = ""
 # Сюди додаємо числа з комами
result = ""

for i in st:
    if i.isdigit():
        num += i
    else:
        if num:
            result += num + ", "
            num = ""

if num:
    result += num  # Додаємо останнє число, якщо воно є

print(result.strip(", "))  # Видаляємо зайву кому в кінці
