# print('hello world!!!')-коментувати одинарний
# print('hello world!!!')-є коментар багато строковий він ставиться трьома одинарними
# лапками або двойними трьома-вони використовуються для створення документациї
'''print('hello world!!!')
"""print('hello world!!!')
иьттб ью
Kjhklkj;,;
kjhhgssd
print('hello world!!!')'''

'''# створення зміних та їх типи(number,string,
# це числова зміна (і) number це є фло ціле число
i=5
#це числова зміна (f) number це є фло дробове число і пишемо через крапку, а через кому це перелік
f=5.5
#  в string пишемо слова,строки,вірші,= пишемо в двойних або одинарних ("") || ('')
string='hello'
str= "hello Nata"
# зміна булям 
b=True
b=False'''
# як можна провести до типу і длячого воно потрібно
# маємо дробове і з нього потрібно зробити ціле число(все що після крапки воно обрізає то б то воно не заокруглює)
f=5.2
i=int(f)
print(i)
# можна зробити з цілого дробове- з інтового зробити фло то б то добавить 0
f=5
i=float(f)
print(i)
# можемо перепровіряти завдяки функції і виводить фло значення
f=6
i=float(f)
print(type (i))
# можна зробити стрінгове значення
f=6
i=str(f)
print(type (i))
# для приведеня типів існують функції то бто дають змогу привести до якогось типу
# int()
# float()
# bool()
# str()
# всі цифри вони тру а нуль буде фолз
f=6
i=bool(f)
print(i)
f=0
i=bool(f)
print(i)
